tutorials/multiphase/vof/vofSolver/ras/damBreak/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha1.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 4;
        dynamicCompressionModel none;
        cAlpha          2;
        icAlpha         0;

        MULESCorr       no;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  SSGS;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  SSGS;
        tolerance       1e-07;
        relTol          0.05;
    }

    p_rghFinal
    {
        solver          PCG;
        preconditioner  SSGS;
        tolerance       1e-07;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|epsilon)Final"
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-08;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
